; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-54)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c1)
    (capacity v4 c1)
    (capacity v5 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l10)
    (at p2 l2)
    (at p3 l11)
    (at p4 l5)
    (at p5 l4)
    (at p6 l1)
    (at p7 l10)
    (at p8 l9)
    (at p9 l10)
    (at v1 l4)
    (at v2 l11)
    (at v3 l11)
    (at v4 l2)
    (at v5 l6)
    (road l3 l7)
    (road l5 l4)
    (road l10 l6)
    (road l10 l9)
    (road l11 l8)
    (road l1 l9)
    (road l4 l5)
    (road l3 l9)
    (road l9 l1)
    (road l10 l2)
    (road l8 l11)
    (road l11 l1)
    (road l9 l10)
    (road l1 l11)
    (road l2 l10)
    (road l7 l3)
    (road l6 l10)
    (road l4 l1)
    (road l9 l3)
    (road l1 l4)
    )
 (:goal (and 
(at p1 l3)
(at p2 l9)
(at p3 l10)
(at p4 l4)
(at p5 l2)
(at p6 l4)
(at p7 l8)
(at p8 l11)
))
)

; plan
1. (pick-up v2 l11 p3 c1 c2)
   deleted: (at p3 l11) (capacity v2 c2)
   added: (in p3 v2) (capacity v2 c1)
   goals met: 0 of 8
2. (drive v2 l11 l1)
   deleted: (at v2 l11)
   added: (at v2 l1)
   goals met: 0 of 8
3. (pick-up v2 l1 p6 c0 c1)
   deleted: (at p6 l1) (capacity v2 c1)
   added: (in p6 v2) (capacity v2 c0)
   goals met: 0 of 8
4. (drive v2 l1 l4)
   deleted: (at v2 l1)
   added: (at v2 l4)
   goals met: 0 of 8
5. (drop v2 l4 p6 c0 c1)
   deleted: (in p6 v2) (capacity v2 c0)
   added: (at p6 l4) (capacity v2 c1)
   goals met: 1 of 8
6. (pick-up v2 l4 p5 c0 c1)
   deleted: (at p5 l4) (capacity v2 c1)
   added: (in p5 v2) (capacity v2 c0)
   goals met: 1 of 8
7. (drive v2 l4 l1)
   deleted: (at v2 l4)
   added: (at v2 l1)
   goals met: 1 of 8
8. (drive v2 l1 l9)
   deleted: (at v2 l1)
   added: (at v2 l9)
   goals met: 1 of 8
9. (drive v2 l9 l10)
   deleted: (at v2 l9)
   added: (at v2 l10)
   goals met: 1 of 8
10. (drop v2 l10 p3 c0 c1)
   deleted: (in p3 v2) (capacity v2 c0)
   added: (at p3 l10) (capacity v2 c1)
   goals met: 2 of 8
11. (pick-up v2 l10 p7 c0 c1)
   deleted: (at p7 l10) (capacity v2 c1)
   added: (in p7 v2) (capacity v2 c0)
   goals met: 2 of 8
12. (drive v2 l10 l2)
   deleted: (at v2 l10)
   added: (at v2 l2)
   goals met: 2 of 8
13. (drop v2 l2 p5 c0 c1)
   deleted: (in p5 v2) (capacity v2 c0)
   added: (at p5 l2) (capacity v2 c1)
   goals met: 3 of 8
14. (pick-up v2 l2 p2 c0 c1)
   deleted: (at p2 l2) (capacity v2 c1)
   added: (in p2 v2) (capacity v2 c0)
   goals met: 3 of 8
15. (drive v2 l2 l10)
   deleted: (at v2 l2)
   added: (at v2 l10)
   goals met: 3 of 8
16. (drive v2 l10 l9)
   deleted: (at v2 l10)
   added: (at v2 l9)
   goals met: 3 of 8
17. (drop v2 l9 p2 c0 c1)
   deleted: (in p2 v2) (capacity v2 c0)
   added: (at p2 l9) (capacity v2 c1)
   goals met: 4 of 8
18. (pick-up v2 l9 p8 c0 c1)
   deleted: (at p8 l9) (capacity v2 c1)
   added: (in p8 v2) (capacity v2 c0)
   goals met: 4 of 8
19. (drive v2 l9 l1)
   deleted: (at v2 l9)
   added: (at v2 l1)
   goals met: 4 of 8
20. (drive v2 l1 l11)
   deleted: (at v2 l1)
   added: (at v2 l11)
   goals met: 4 of 8
21. (drop v2 l11 p8 c0 c1)
   deleted: (in p8 v2) (capacity v2 c0)
   added: (at p8 l11) (capacity v2 c1)
   goals met: 5 of 8
22. (drive v2 l11 l8)
   deleted: (at v2 l11)
   added: (at v2 l8)
   goals met: 5 of 8
23. (drop v2 l8 p7 c1 c2)
   deleted: (in p7 v2) (capacity v2 c1)
   added: (at p7 l8) (capacity v2 c2)
   goals met: 6 of 8
24. (drive v1 l4 l5)
   deleted: (at v1 l4)
   added: (at v1 l5)
   goals met: 6 of 8
25. (pick-up v1 l5 p4 c0 c1)
   deleted: (at p4 l5) (capacity v1 c1)
   added: (in p4 v1) (capacity v1 c0)
   goals met: 6 of 8
26. (drive v5 l6 l10)
   deleted: (at v5 l6)
   added: (at v5 l10)
   goals met: 6 of 8
27. (pick-up v5 l10 p1 c0 c1)
   deleted: (at p1 l10) (capacity v5 c1)
   added: (in p1 v5) (capacity v5 c0)
   goals met: 6 of 8
28. (drive v5 l10 l9)
   deleted: (at v5 l10)
   added: (at v5 l9)
   goals met: 6 of 8
29. (drive v5 l9 l3)
   deleted: (at v5 l9)
   added: (at v5 l3)
   goals met: 6 of 8
30. (drop v5 l3 p1 c0 c1)
   deleted: (in p1 v5) (capacity v5 c0)
   added: (at p1 l3) (capacity v5 c1)
   goals met: 7 of 8
31. (drive v1 l5 l4)
   deleted: (at v1 l5)
   added: (at v1 l4)
   goals met: 7 of 8
32. (drop v1 l4 p4 c0 c1)
   deleted: (in p4 v1) (capacity v1 c0)
   added: (at p4 l4) (capacity v1 c1)
   goals met: 8 of 8
